hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
    // ---- skip preamble up to and including the first boundary delimiter ----
    {
        const uint8_t *p = mp_mem_find(buf, buf_len, delim, (size_t)delim_len);
        if (!p)
            goto done; // no boundary at all: not a well-formed multipart body
        size_t skip = (size_t)(p - buf) + (size_t)delim_len;
        memmove(buf, buf + skip, buf_len - skip);
        buf_len -= skip;
    }

    for (int part_idx = 0; part_idx < MP_MAX_PARTS; part_idx++) {
        // Right after a delimiter: either "--" (terminating boundary, no more
        // parts) or "\r\n" (a part follows).
        if (buf_len < 2)
            MP_FILL();
        if (buf_len < 2) {
            // Body ended right at/after the last part's own closing boundary
            // (no distinguishable final "--" epilogue left to read). If we
            // already streamed a file part, that's a completed upload, not
            // an error - only a genuinely empty/truncated body is malformed.
            result = found_file_part ? ESP_OK : ESP_FAIL;
            goto done;
        }
        if (buf[0] == '-' && buf[1] == '-') {
            result = found_file_part ? ESP_OK : ESP_ERR_NOT_FOUND;
            goto done;
        }
        if (buf[0] != '\r' || buf[1] != '\n')
            goto done; // malformed
        memmove(buf, buf + 2, buf_len - 2);
        buf_len -= 2;

        // ---- part headers, up to the blank line ----
        char headers[MP_MAX_HEADER];
        const uint8_t *hp;
        for (;;) {
            hp = mp_mem_find(buf, buf_len, "\r\n\r\n", 4);
            if (hp)
                break;
            if (buf_len >= MP_BUF_CAP || remaining <= 0)
                goto done; // headers too large or body ended mid-header: malformed
            MP_FILL();
        }
        size_t hdrblock_len = (size_t)(hp - buf);
        size_t hdrcopy_len = hdrblock_len < sizeof(headers) - 1 ? hdrblock_len : sizeof(headers) - 1;
        memcpy(headers, buf, hdrcopy_len);
        headers[hdrcopy_len] = 0;
        size_t consumed = hdrblock_len + 4;
        memmove(buf, buf + consumed, buf_len - consumed);
        buf_len -= consumed;

        // ---- does this part carry filename="..."? ----
        bool has_filename = false;
        {
            const char *cdisp = mp_ci_strstr(headers, "Content-Disposition");
            if (cdisp) {
                const char *fn = mp_ci_strstr(cdisp, "filename=\"");
                if (fn) {
                    fn += 10;
                    const char *end = strchr(fn, '"');
                    if (end && end > fn) {
                        has_filename = true;
                        if (filename_out && filename_out_size) {
                            size_t flen = (size_t)(end - fn);
                            if (flen >= filename_out_size)
                                flen = filename_out_size - 1;
                            memcpy(filename_out, fn, flen);
                            filename_out[flen] = 0;
                        }
                    }
                }
            }
        }
        bool stream_this = has_filename && !found_file_part;

        // ---- part data, up to the next "\r\n--boundary" ----
        for (;;) {
            const uint8_t *cm = mp_mem_find(buf, buf_len, close_marker, (size_t)close_len);
            if (cm) {
                size_t data_len = (size_t)(cm - buf);
                if (stream_this && data_len > 0 && cb(cb_ctx, buf, data_len) != ESP_OK)
                    goto done;
                size_t used = data_len + (size_t)close_len;
                memmove(buf, buf + used, buf_len - used);
                buf_len -= used;
                break;
            }
            // No full marker in the buffer yet: flush everything except the
            // tail that could still be a prefix of the marker, then refill.
            size_t keep = (size_t)close_len - 1;
            if (buf_len > keep) {
                size_t flush = buf_len - keep;
                if (stream_this && cb(cb_ctx, buf, flush) != ESP_OK)
                    goto done;
                memmove(buf, buf + flush, buf_len - flush);
                buf_len -= flush;
            }
            if (remaining <= 0)
                goto done; // ran out of body before finding the closing boundary: truncated/malformed
            MP_FILL();
        }

        if (has_filename)
            found_file_part = true;
        // loop back: buffer now starts right after this part's boundary
        // delimiter, exactly the state the top of the loop expects.
    }
    // MP_MAX_PARTS exceeded without reaching a terminating boundary.
    result = ESP_FAIL;

done:
    free(buf);
#undef MP_FILL
    return result;
}

// ---------------------------------------------------------------- HTML shell
// Sidebar menu mirrors the original firmware's route order/labels exactly.
struct menu_item {
    const char *href;
    const char *label;
    const char *key;
};
static const struct menu_item MENU[] = {
#ifdef ENABLE_DASHBOARD
    { "/dashboard", TR_MENU_DASHBOARD, "dashboard" },
#endif
#ifdef ENABLE_STATION
    { "/station", TR_MENU_STATION, "station" },
#endif
#ifdef ENABLE_MSG_CHAT
    { "/msgchat", TR_MENU_MSGCHAT, "msgchat" },
#endif
#ifdef ENABLE_BULLETINS
    { "/bulletins", TR_MENU_BULLETINS, "bulletins" },
#endif
#ifdef ENABLE_OBJECTS_ITEMS
    { "/objects", TR_MENU_OBJITEMS, "objects" },
#endif
#ifdef ENABLE_RADIO_MODEM
    { "/radio", TR_MENU_RADIO, "radio" },
#endif
#ifdef ENABLE_MESSAGE
    { "/msg", TR_MENU_MSG, "msg" },
#endif
#ifdef ENABLE_IGATE
    { "/igate", TR_MENU_IGATE, "igate" },
#endif
#ifdef ENABLE_DIGIPEATER
    { "/digi", TR_MENU_DIGI, "digi" },
#endif
#ifdef ENABLE_TRACKER
    { "/tracker", TR_MENU_TRACKER, "tracker" },
#endif
#ifdef ENABLE_WEATHER
    { "/wx", TR_MENU_WX, "wx" },
#endif
#ifdef ENABLE_TELEMETRY
    { "/tlm", TR_MENU_TLM, "tlm" },
#endif
#ifdef ENABLE_SYSTEM
    { "/system", TR_MENU_SYSTEM, "system" },
#endif
#ifdef ENABLE_WIRELESS
    { "/wireless", TR_MENU_WIRELESS, "wireless" },
#endif
#ifdef ENABLE_FILE_STORAGE
    { "/storage", TR_MENU_STORAGE, "storage" },
#endif
#ifdef ENABLE_ABOUT_FIRMWARE
    { "/about", TR_MENU_ABOUT, "about" },
#endif
};
#define MENU_COUNT (sizeof(MENU) / sizeof(MENU[0]))

void web_send_header(httpd_req_t *req, const char *title, const char *active_menu) {
    httpd_resp_set_type(req, "text/html");
    // Config pages render live g_config values into the form on every GET.
    // Without this header, browsers (especially after a POST->redirect->GET
    // save flow) may serve a cached copy of the page instead of re-fetching,
    // so a value that was just saved appears not to have been saved at all.
    httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");
    httpd_resp_sendstr_chunk(req, "<!DOCTYPE html><html><head><meta charset='utf-8'>"
                                  "<meta name='viewport' content='width=device-width,initial-scale=1'>"
                                  "<link rel='stylesheet' href='/style.css'>"
                                  "<title>ESP32APRS</title></head><body>"
                                  "<div class='topbar'><span class='brand'>" TR_BRAND "</span>"
                                  "<a class='logout' href='/logout'>" TR_LOGOUT "</a></div>"
                                  "<div class='layout'><nav class='sidebar'><ul>");

    for (size_t i = 0; i < MENU_COUNT; i++) {
        char line[160];
        bool is_active = active_menu && strcmp(active_menu, MENU[i].key) == 0;
        snprintf(line, sizeof(line), "<li><a href='%s'%s>%s</a></li>", MENU[i].href, is_active ? " class='active'" : "", MENU[i].label);
        httpd_resp_sendstr_chunk(req, line);
    }
    httpd_resp_sendstr_chunk(req, "</ul></nav><main class='content'>");
    if (title) {
        httpd_resp_sendstr_chunk(req, "<h1>");
        httpd_resp_sendstr_chunk(req, title);
        httpd_resp_sendstr_chunk(req, "</h1>");
    }
}

void web_send_footer(httpd_req_t *req) {
    httpd_resp_sendstr_chunk(req, "<script>function togglePwd(id,cb){var el=document.getElementById(id);if(el){el.type=(cb&&cb.checked)?'text':'password';}}</script>");
    httpd_resp_sendstr_chunk(req, "</main></div></body></html>");
    httpd_resp_sendstr_chunk(req, NULL); // end chunked response
}

